In [2]:
import pandas as pd

In [5]:
pd. Series([1,2,3,4],['usa','china', 'eourp','africa'])

usa       1
china     2
eourp     3
africa    4
dtype: int64

In [11]:
improt numpy as np

SyntaxError: invalid syntax (<ipython-input-11-45035df83139>, line 1)

In [17]:
import numpy as np
np.random.seed(100)

In [18]:
df= pd. DataFrame(randn (5,4),['a','b','c','d','e'],['w','x','y','z'])

NameError: name 'randn' is not defined

In [19]:
randn(5,4)

NameError: name 'randn' is not defined

In [20]:
np.randn(5,4)

AttributeError: module 'numpy' has no attribute 'randn'

In [21]:
np.random.randn(5.4)

TypeError: 'float' object cannot be interpreted as an integer

In [1]:
import numpy as np
import pandas as pd

In [3]:
lables = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(my_list,lables)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(data=lables)

0    a
1    b
2    c
dtype: object

In [14]:
ser1 = pd.Series([1,2,3,4], index = ['USA','GERMANY','USSR','JAPAN'])

In [15]:
ser1

USA        1
GERMANY    2
USSR       3
JAPAN      4
dtype: int64

In [16]:
alex_fami = pd.Series(['alex','shannie','angela'], index = [1,2,3])

In [17]:
alex_fami

1       alex
2    shannie
3     angela
dtype: object

In [21]:
ser1['USA']

1

In [22]:
ser2 = pd.Series([1,2,3,4], index = ['USA','GERMANY','ITALY','JAPAN'])

In [23]:
ser1 + ser2

GERMANY    4.0
ITALY      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

In [25]:
from numpy.random import randn
np.random.seed(101)

In [35]:
df = pd.DataFrame(randn(5,4),index = ['A','B','C','D','E'],columns = 'W X Y Z'.split())

In [39]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [44]:
df.W

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [45]:
df['new'] = df['W'] + df['Y']

In [46]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [49]:
df.drop('A',axis=0)

          W         X         Y         Z       new
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [50]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [51]:
df.loc['A']

W     -0.993263
X      0.196800
Y     -1.136645
Z      0.000366
new   -2.129908
Name: A, dtype: float64

In [54]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [56]:
df.loc['A']

W     -0.993263
X      0.196800
Y     -1.136645
Z      0.000366
new   -2.129908
Name: A, dtype: float64

In [57]:
df.iloc[2]

W      2.154846
X     -0.610259
Y     -0.755325
Z     -0.346419
new    1.399521
Name: C, dtype: float64

In [59]:
df['W']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [60]:
df.loc['B','Y']

-0.031579143908112575

In [65]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [66]:
df>0

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [67]:
df[df>0]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [74]:
df[df['W']>0]['Y']

B   -0.031579
C   -0.755325
D    0.558769
Name: Y, dtype: float64

In [75]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [77]:
df[(df['W']>0) & (df['Y'] > 1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [78]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [79]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [81]:
newind= 'CA NY WY OR CO'.split()
df['states']=newind

In [82]:
df

          W         X         Y         Z states
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [89]:
df.set_index('states',inplace=True)

In [90]:
df

               W         X         Y         Z
states
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [96]:
outside = 'G1 G1 G1 G2 G2 G2'.split( )
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [97]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [98]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [99]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [100]:
df.xs('G1')

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [102]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [105]:
df.xs(1,level='Num')

             A         B
group
G1     0.38603  2.084019
G2    -0.03116  1.939932

In [104]:
df.index.names = ['group','Num']